posts/2020-04-27/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Eurocrypt 2020 (may 11-15) has a few quantum papers">
<meta name="viewport" content="width=device-width">
<title>Quantum Papers at Eurocrypt 2020 | Qoherences</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://h-oll.github.io/qoherences/posts/2020-04-27/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Harold Ollivier">
<meta property="og:site_name" content="Qoherences">
<meta property="og:title" content="Quantum Papers at Eurocrypt 2020">
<meta property="og:url" content="https://h-oll.github.io/qoherences/posts/2020-04-27/">
<meta property="og:description" content="Eurocrypt 2020 (may 11-15) has a few quantum papers">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-04-27T09:53:56+02:00">
</head>
<body>
    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://h-oll.github.io/qoherences/" title="Qoherences" rel="home">
                Qoherences
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                Quantum Papers at Eurocrypt 2020
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2020-04-27T09:53:56+02:00">2020/04/27</time>
	    

	    
          |  
        <a href="index.org" id="sourcelink">Source</a>

	  </div>
	  <div class="post-tags">
	  </div>
	</div>
      </div>
    </div>


    <div id="post-main" class="main">
        <div class="container">
        <p>
<a href="https://eurocrypt.iacr.org/2020/">Eurocrypt</a> is one major conference in cryptography and secure computing. This year it will go virtual may 11-15. As usual it will have a few (good) talks on quantum. I've already seen "Secure Multi-party Quantum Computation with a Dishonest Majority" it's a nice one!
</p>

<p>
The final program hasn't been released yet. The page will be updated then.
</p>

<ul class="org-ul">
<li>Optimal Merging in Quantum k-xor and k-sum Algorithms
<ul class="org-ul">
<li>María Naya-Plasencia (Inria, France); André Schrottenloher (Inria, France)</li>
</ul>
</li>
<li>Implementing Grover oracles for quantum key search on AES and LowMC
<ul class="org-ul">
<li>Samuel Jaques (Department of Materials, University of Oxford, UK); Michael Naehrig (Microsoft Research, Redmond, USA); Martin Roetteler (Microsoft Quantum, Redmond, USA); Fernando Virdia (Information Security Group, Royal Holloway, University of London, UK)</li>
</ul>
</li>
<li>On the Quantum Complexity of the Continuous Hidden Subgroup Problem
<ul class="org-ul">
<li>Koen de Boer (Cryptology Group, CWI, Amsterdam, The Netherlands); Léo Ducas (Cryptology Group, CWI, Amsterdam, The Netherlands); Serge Fehr (Cryptology Group, CWI, Amsterdam, The Netherlands and Mathematical Institute, Leiden University, The Netherlands)</li>
</ul>
</li>
<li>Secure Multi-party Quantum Computation with a Dishonest Majority
<ul class="org-ul">
<li>Yfke Dulek (QuSoft and U. Amsterdam); Alex B. Grilo (QuSoft and CWI); Stacey Jeffery (QuSoft and CWI); Christian Majenz (QuSoft and CWI); Christian Schaffner (QuSoft and U. Amsterdam)</li>
</ul>
</li>
<li>Quantum Security Analysis of CSIDH
<ul class="org-ul">
<li>Xavier Bonnetain (Inria, France); André Schrottenloher (Inria, France)</li>
</ul>
</li>
<li>Fractal: Post-Quantum and Transparent Recursive Proofs from Holography
<ul class="org-ul">
<li>Alessandro Chiesa (UC Berkeley); Dev Ojha (UC Berkeley); Nicholas Spooner (UC Berkeley)</li>
</ul>
</li>
<li>Finding Hash Collisions with Quantum Computers by Using Differential Trails with Smaller Probability than Birthday Bound
<ul class="org-ul">
<li>Akinori Hosoyamada (NTT Secure Platform Laboratories and Nagoya University); Yu Sasaki (NTT Secure Platform Laboratories)</li>
</ul>
</li>
<li>Measure-Rewind-Measure: Tighter Quantum Random Oracle Model Proofs for One-Way to Hiding Lemma and CCA Security
<ul class="org-ul">
<li>Veronika Kuchta (Monash University, Australia); Amin Sakzad (Monash University, Australia); Damien Stehlé (ENS de Lyon, France); Ron Steinfeld (Monash University, Australia); Shi-Feng Sun (Monash University and Data61, CSIRO, Australia)</li>
</ul>
</li>
<li>Quantum-access-secure message authentication via blind-unforgeability
<ul class="org-ul">
<li>Gorjan Alagic (QuICS, University of Maryland, and NIST, Gaithersburg, Maryland); Christian Majenz (QuSoft and CWI, Amsterdam, The Netherlands); Alexander Russell (Department of Computer Science and Engineering, University of Connecticut); Fang Song (Texas A&amp;M University)</li>
</ul>
</li>
</ul>
<p>
<a href="https://eurocrypt.iacr.org/2020/registration.php">Register</a>
</p>
            
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="qoherences",
            disqus_url="https://h-oll.github.io/qoherences/posts/2020-04-27/",
        disqus_title="Quantum Papers at Eurocrypt 2020",
        disqus_identifier="cache/posts/2020-04-27.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        

        </div>
    </div>

    
    <footer><div class="container">
            <div class="social">



                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2020         <a href="mailto:harold.ollivier@linksights.io">Harold Ollivier</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><!-- Global site tag (gtag.js) - Google Analytics --><script async src="https://www.googletagmanager.com/gtag/js?id=UA-150665042-1"></script><script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());

  gtag('config', 'UA-150665042-1');
</script><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
